{"_id":{"$oid":"5dc8d2cf0634a60dd007892f"},"name":"Liềm Hoàng Long","age":20,"pass":"1231565","__v":0}
{"_id":{"$oid":"5dc8d2eb0634a60dd0078930"},"name":"Hà Quang Linh","age":59,"pass":"v2351435y","__v":0}
{"_id":{"$oid":"5dc8d2fb0634a60dd0078931"},"name":"Cháu Vĩnh Lập","age":31,"pass":"n6b43v6bu","__v":0}
{"_id":{"$oid":"5dc98afd4541b737d0058fd3"},"name":"as","age":20,"pass":"1324","__v":0}
{"_id":{"$oid":"5dc98b174541b737d0058fd4"},"name":"5. BEM Block, Element, Modifier: Quy tắc đặt tên để viết CSS class dễ đọc, nhất quán, dễ maintain.  Khi sử dụng hệ phương pháp BEM, ta có thể tạo được nhiều class theo cú pháp block__element--modifier xuyên xuốt cả project.  Blocks là tên của các thực thể riêng lẻ, như menu hoặc button. Elements là các phần hoặc functionality khác nhau của blocks, như success hoặc alert. Modifiers thay đổi style của blocks, như lớn hoặc nhỏ. Ví dụ như, .button__alert--large chính là một tên class BEM hợp lệ.","age":13,"pass":"32","__v":0}
{"_id":{"$oid":"5dc98b2c4541b737d0058fd5"},"name":"Phần lớn CMS được sử dụng cho việc đăng tải nội dung web, như WordPress, Drupal, và Joomla. CMSs tách biệt nội dung khỏi hiển thị và tính năng, nên ta hoàn toàn có thể quản lý nội dung web dù chả biết tý code nào.  8. CRUD Create, Read, Update, Delete: thuật ngữ chuyên dùng trong quản trị cơ sở dữ liệu, gồm bốn hàm cơ bản của một cơ sở dữ liệu chuẩn mực.  Trong SQL, 4 lệnh liên quan gồm: INSERT (với Create), SELECT (với Read), UPDATE (với Update), and DELETE (với Delete).  Các hàm CRUD mô tả vòng đời dữ liệu thường thấy ở một dynamic website.  9. CSSOM Cascading Style Sheets Object Model: một bộ APIs được trình duyệt sử dụng để render đúng CSS style trên một trang web.  CSSOM thể hiện tất cả CSS styles (selectors và các tính năng của chúng) trên một trang web dưới dạng map của node. CSSOM có cấu trúc cây tương tự DOM (Document Object Model), nhưng lại là một mô hình dữ liệu hoàn toàn độc lập.  10. CTA Call-To-Action: thuật ngữ marketing chuyên dùng trong web design.  CTA là một thông điệp kêu gọi hành động trực tiếp đến người dùng hoặc khách hàng tiềm năng. Trong thiết kế web, CTAs thường là các đường link được “trang trí” để dụ dỗ người dùng click vào một nút bấm, banner, mẫu quảng cáo,…  11. DOM Document Object Model: an API (Application Programming Interface) cho các tài liệu HTML và XML, được trình duyệt sử dụng để render những tài liệu này.  DOM chỉ ra cấu trúc logic của một tài liệu, và thể hiện cấu trúc này dưới dạng node tree, trong đó node là các object thể hiện các phần khác nhau của một document. Có thể tạo, chỉnh sửa và xóa bỏ node.  12. ECMAScript (ES) European Computer Manufacturers Association Script: a quy chuẩn ngôn ngữ scripting, và là cơ sở cho cú pháp của JavaScript, cùng JScipt và ActionScript.  ECMAScript có tên từ European Computer Manufacturers Association (Hiệp Hội Sản Xuất Máy Tính Châu Âu), tổ chức đã chuẩn hóa các quy luật này.  13. FOSS Free and Open-Source Software: phần mềm miễn phí (không ràng buộc bản quyền) và nguồn mở (bất cứ ai cũng truy cập và chỉnh sửa mã nguồn được).  Còn có tên FLOSS (Free/Libre and Open-Source Software).  14. FTU First Time Use: lần đầu tiên người dùng tải ứng dụng sau khi cài đặt.  FTU là một phần quan trọng trong quá trình tiếp nhận ứng dụng. Với thiết kế khời động phù hợp, ta có thể cải thiện tỷ lệ nán lại của người dùng. Trong lúc FTU, ta có thể thể hiện cách làm việc của một ứng dụng, hoặc đề nghị người dùng thiết đặt một số tinh chỉnh quan trọng (time zone, ngôn ngữ, theo sở thích,…)  15. GUI Graphical User Interface: một kiểu giao diện người dùng, ngược lại với command-driven interfaces (giao diện xoay quanh dòng lệnh).","age":23,"pass":"132","__v":0}
{"_id":{"$oid":"5dca1044c6f6c937b44f7b82"},"name":"<p>Hôm nay phỏng vấn vị trí CSKH cho 1 trung tâm, có em phỏng vấn rất tốt, có em chưa được tốt lắm. Note lại một vài điều mình quan sát được ở đây cho các bạn đi phỏng vấn chỗ khác có thể lưu ý phỏng vấn tốt hơn.<br>1/ Một cuộc phỏng vấn bắt đầu từ khi bạn ngồi chờ, không phải là lúc bạn ngồi trước mặt nhà tuyển dụng. Vì khi ngồi chờ là đã có nhiều người quan sát bạn rồi. Thay vì ngồi ôm điện thoại lướt Facebook, hãy tranh thủ lúc chờ ngồi quan sát xung quanh xem công ty có gì hay, văn hoá làm việc của mọi người như thế nào, biết đâu xài được gì trong lúc trả lời phỏng vấn lại sẽ gây ấn tượng hơn. Như vậy thể hiện bạn là một người biết quan sát.<br>2/ Vị trí này có nhiều bạn sinh viên đến ứng tuyển, nên mình thấy rất nhiều bạn vào phòng phỏng vấn mà vẫn đeo ba lô, ngồi xuống ghế mới bắt đầu loay hoay bỏ ra. Như thế trông không hay tí nào. Trước khi bước vào phòng phỏng vấn, hãy bỏ hết ba lô ra, đừng đeo trên người. Nếu có mang theo CV thì lôi ra luôn, cầm sẵn trên tay, đừng để vào đến nơi mới bắt đầu ngồi loay hoay tìm xem CV ở đâu nhé.<br>3/ Phỏng vấn 2 ngày nay rồi mà không thấy bạn nào đem theo CV bản cứng. Cho dù cái này không đề cập trong mail và mình cũng có in sẵn CV ra rồi, nhưng nếu bạn đem theo một bản cứng đưa cho mình thì mình vẫn ấn tượng hơn. <br>4/ \"Em có câu hỏi gì trước khi kết thúc buổi phỏng vấn không?\" - \"Em không ạ!\". Trời ơi, chẳng lẽ trước khi đi phỏng vấn em không tìm hiểu gì sao? Hay cái gì em cũng biết về công ty rồi?<br>5/ Tối thiểu hãy biết tên công ty đầy đủ trước khi bạn đi phỏng vấn. Ví dụ như tên công ty là FPT Telecom - Công ty Cổ phần Viễn thông FPT. Thế mà nhiều bạn đến nơi thao thao bất tuyệt về các đơn vị FPT khác: về phần mềm, về bán lẻ... Mất điểm nghiêm trọng khủng khiếp. <br> 6/ Các em đến ứng tuyển công việc, không phải xin cho gì hết, nên cứ hùng hổ bước vào, đừng ngại. Nhiều em đến mở cửa xong thò đầu vào hỏi lí nha lí nhí, nghe đã không ấn tượng rồi. Thay vào đó, khi được mời vào ngồi phỏng vấn, các em ngồi xuống, nhìn thẳng vào mắt nhà tuyển dụng, lẩm nhẩm câu thần chú của Nguyễn Hương Giang đã dạy 'Đ'o sợ bố con thằng nào' và cười một cái cho tự tin nha. <br> 7/ Cuối cùng và nhắc đi nhắc lại, dù cảm thấy mình phỏng vấn tốt hay hơi hơi fail hay thậm chí fail lòi rồi thì hãy lịch sự gửi lại một email cảm ơn nhà tuyển dụng. Như thế là phép lịch sự tối thiểu và giúp em gây ấn tượng hơn với người đã nói chuyện. Một bạn chuyên môn chưa giỏi nhưng tính cách tốt thì sẽ vẫn có nhiều cơ hội. Ví dụ vị trí CSKH này mình chỉ dự định tuyển 1 bạn thôi, nhưng công ty luôn để sẵn 2-3 options cho các bạn tiềm năng để giới thiệu đến các đối tác của trung tâm đấy.</p>","age":23,"pass":"1234","__v":0}
